app/Controllers/GetImagesDB.php

    public function indexImg()
    {
        $model = new DataImgAjaxSearch();
        $data['urlimgsearch'] = $model->findAll();
---
SELECT *
FROM `urlimgsearch`